package denis.model;

public enum TextMessage {
    helloMessage("Привіт! \uD83D\uDC4B\n" +
            "\n" +
            "Мене звати Шрек, і я — чатбот для мешканців, чиї будинки знаходяться в управлінні ОСББ або управляючих компаній \uD83E\uDD16\n" +
            "\n" +
            "Для початку, поділіться, будь ласка, зі мною вашим номером телефону, натиснувши на кнопку під цим повідомленням \uD83D\uDC47\n" +
            "\n" +
            "Зауважте, що поділитися номером можна лише з мобільної або десктопної версії Телеграма — з веб-версії (в браузері) це зробити неможливо ❗️"),
    erorMessage("Вибачте, але я вас не зрозумів. Щоб продовжити, натисніть одну з КНОПОК нижче \uD83D\uDC47"),
    sendLocation("Дякую, ваш номер успішно записаний" + "\n" +
            "Наступний крок реєстрація вашого житла!\nДля цього вам буде достатньо відправити мені геолокацію з МОБІЛЬНОГО телефону — а я вже визначу адресу. Але зауважте, що геолокацію можливо відправити ВИКЛЮЧНО з мобільного \uD83D\uDCCD" + "\n" +
            "\n" +
            "\uD83D\uDD39 Якщо ви зараз знаходитесь за адресою, яку хочете додати, просто відправте мені вашу поточну геолокацію, натиснувши на відповідну кнопку\n" +
            "\uD83D\uDD39 Якщо ви зараз НЕ знаходитесь за адресою, натисніть на кнопку \"Ввести адресу вручну\" і вкажіть адресу вашого житла за допомогою клавіатури"),
    successLocation("Дякую, ваша геолокація успішно записана!"),
    clickCaseMainMenu("Оберіть що саме вас цікавить:"),
    clickCaseCreateStep1("Вкажіть тему звернення:"),
    clickCaseCreateStep2("Вкажіть опис звернення:"),
    clickCaseCreateSuccess("Звернення успішно створено!"),
    clickHelpMainMenu("Відео-інструкцію щодо використання чатбота ви можете переглянути за посиланням нижче \uD83D\uDC47\n" +
            "\n" +
            "https://www.youtube.com/watch?v=ql9TiOhGx0s");

    private String value;

    public String getValue(TextMessage textMessage) {
        return String.valueOf(textMessage.value);
    }

    TextMessage(String value) {
        this.value = value;
    }
}
